step-1/load-test/get-all-books-view-details.yml
config:
    target: "https://CHANGEME.apigateway.us-ashburn-1.oci.customer-oci.com/v1"
    phases:
      - duration: 10
        arrivalRate: 1
        name: Warm up
      - duration: 20
        arrivalRate: 1
        rampTo: 2
        name: Ramp up load
      - duration: 60
        arrivalRate: 2
        name: Sustained load
    variables:
      id:
        - "5"
        - "4"
        - "3"
        - "2"
        - "076DA47A4377430C9239D1098400B259"
scenarios:
    # We define one scenario:
    - name: "Browse all books"
      flow:
        - get:
            url: "/dbooks"
        # Get the details of the book:
        - get:
            url: "/books/{{ id }}"